Repository: Depool/RailwaysDBApp
Catalog: RailwaysDBApp/Properties/Resources.*.resx
Languages: ru_ru, uk_ua

source: Carriages
ru_ru: О вагонах поездов
uk_ua: Про вангони поїздів

# CARRIAGES_AMOUNT
source: Amount included into train
ru_ru: Количество в данном поезде
uk_ua: Кількість вагонів даного типу

# CARRIAGES_CARRIAGE_TYPE_ID
source: Id of the type of the carriage
ru_ru: Номер типа вагона
uk_ua: Номер типу вагона

# CARRIAGES_ID
source: Carriage id
ru_ru: Номер записи
uk_ua: Номер запису

# CARRIAGES_TRAIN_ID
source: Id of corresponding train
ru_ru: Номер поезда
uk_ua: Номер поїзда

# CARRIAGE_TYPE
source: Types of carriages
ru_ru: Типы вагонов
uk_ua: Типи вагонів

# CARRIAGE_TYPE_ID
source: Id of the carriage type
ru_ru: Номер типа вагона
uk_ua: Номер типу вагону

# CARRIAGE_TYPE_NAME
source: Name of the carriage type
ru_ru: Имя типа вагона
uk_ua: Назва типу вагону

# CARRIAGE_TYPE_PLACES
source: Number of places
ru_ru: Количество мест
uk_ua: Кількість місць

# CARRIAGE_TYPE_PRICE_MULTIPLIER
source: Price multiplier
ru_ru: Множитель стоимости
uk_ua: Множник вартості

# EDGES
source: Railroad connections
ru_ru: Железнодорожные соединения станций
uk_ua: Залізничні сполучення станцій

# EDGES_FIN_ID
source: Id of finishing station
ru_ru: Номер конечной станции
uk_ua: Номер кінцевої станції

# EDGES_ID
source: Id of the edge
ru_ru: Номер соединения
uk_ua: Номер сполучення

# EDGES_PASS_TIME
source: Time needed to pass
ru_ru: Время проезда
uk_ua: Час проїзду

# EDGES_START_ID
source: Id of starting station
ru_ru: Номер начальной станции
uk_ua: Номер початкової станції

# EditDBWindow_Name
source: Edit DB tables
ru_ru: Редактирование таблиц БД
uk_ua: Редагування таблиць БД

# MainMenu_EditTables
source: Edit DB tables
ru_ru: Редактировать БД
uk_ua: Редагувати таблиці БД

# MainMenu_Name
source: Main menu
ru_ru: Главное меню
uk_ua: Головне меню

# MainMenu_Routes
source: Edit routes
ru_ru: Добавить маршруты
uk_ua: Редагувати маршрути

# MainMenu_Settings
source: Settings
ru_ru: Настройки
uk_ua: Налаштування

# MainWindow_Go
source: Go
ru_ru: Вперед
uk_ua: Вперед

# MainWindow_Login
source: Login:
ru_ru: Логин:
uk_ua: Логін:

# MainWindow_LoginFault
source: Incorrect login or password
ru_ru: Неверный логин или пароль
uk_ua: Невірний логін чи пароль

# MainWindow_Name
source: Railways
ru_ru: Железные дороги
uk_ua: Залізниця

# MainWindow_Password
source: Password:
ru_ru: Пароль:
uk_ua: Пароль:

# RACES
source: Races of trains
ru_ru: Рейсы поездов
uk_ua: Рейси поїздів

# RACES_ID
source: Id of the race
ru_ru: Номер рейса
uk_ua: Номер рейсу

# RACES_START_TIME
source: Date and time of departure
ru_ru: Дата и время отправления
uk_ua: Дата та час відправлення

# RACES_TRAIN_ID
source: Id of the train of the race
ru_ru: Номер поезда
uk_ua: Номер поїзда рейсу

# Settings_Language
source: Language:
ru_ru: Язык:
uk_ua: Мова:

# Settings_Name
source: Settings
ru_ru: Настройки
uk_ua: Налаштування

source: Stations
ru_ru: Станции
uk_ua: Станції

# STATIONS_ID
source: Id of the station
ru_ru: Номер станции
uk_ua: Номер станції

# STATIONS_NAME
source: Name of the station
ru_ru: Имя станции
uk_ua: Назва станції

source: Stops
ru_ru: Остановки
uk_ua: Зупинки

# STOPS_ID
source: Id of the stop
ru_ru: Номер записи
uk_ua: Номер запису

# STOPS_PAUSE_TIME
source: Pause time
ru_ru: Время остановки
uk_ua: Час зупинки

# STOPS_STATION_ID
source: Station id
ru_ru: Номер станции
uk_ua: Номер станції

# STOPS_STOP_NUMBER
source: Number of the stop for train
ru_ru: Номер по пути следования поезда
uk_ua: Номер зупинки на шляху слідування

# STOPS_TRAIN_ID
source: Train id
ru_ru: Номер поезда
uk_ua: Номер поїзда

# TICKETS
source: Sold tickets
ru_ru: Проданные билеты
uk_ua: Продані білети

# TICKETS_CARRIAGE_NUMBER
source: Carriage
ru_ru: Вагон
uk_ua: Вагон

# TICKETS_FIN_STATION_NUMBER
source: Number of unboarding station
ru_ru: Номер станции высадки
uk_ua: Номер станції висадки

# TICKETS_ID
source: Ticket id
ru_ru: Номер билета
uk_ua: Номер білета

# TICKETS_PLACE_NUMBER
source: Place
ru_ru: Место
uk_ua: Місце

# TICKETS_RACE_ID
source: Race id
ru_ru: Номер рейса
uk_ua: Номер рейсу

# TICKETS_START_STATION_NUMBER
source: Number of boarding station
ru_ru: Номер станции посадки
uk_ua: Номер станції посадки

source: Trains
ru_ru: Составы
uk_ua: Склади

# TRAINS_ID
source: Train id
ru_ru: Номер поезда
uk_ua: Номер поїзда

# TRAINS_TRAIN_TYPE_ID
source: Train type id
ru_ru: Номер типа поезда
uk_ua: Номер типу поїзда

# TRAIN_TYPE
source: Types of trains
ru_ru: Типы составов
uk_ua: Типи складів

source: Train type id
ru_ru: Номер типа поезда
uk_ua: Номер типу поїзда

source: Train type name
ru_ru: Имя типа поезда
uk_ua: Назва типу поїзда

# TRAIN_TYPE_PRICE_MULTIPLIER
source: Price multiplier
ru_ru: Множитель стоимости
uk_ua: Множник вартості

# TRAIN_TYPE_SPEED_MULTIPLIER
source: Speed multiplier
ru_ru: Множитель скорости
uk_ua: Множник швидкості

# AddUser_AddUser
source: Add user
ru_ru: Добавить пользователя

# AddUser_admin
source: Administrator
ru_ru: Администратор

# AddUser_Fail
source: Attempt to add user failed
ru_ru: Попытка добавить пользователя потерпела неудачу

# AddUser_Login
source: Login:
ru_ru: Логин:

# AddUser_manager
source: Manager
ru_ru: Менеджер

# AddUser_Name
source: Adding user
ru_ru: Добавление пользователя

# AddUser_NonAllFields
source: Not all fields are filled
ru_ru: Заполнены не все поля

# AddUser_Password
source: Password:
ru_ru: Пароль:

# AddUser_PasswordsEqual
source: Passwords don`t match
ru_ru: Пароли не совпадают

# AddUser_Permission
source: Permission:
ru_ru: Права доступа:

# AddUser_RepeatPassword
source: Repeat password:
ru_ru: Повторите пароль:

# AddUser_Success
source: User succesfully registered
ru_ru: Пользователь зарегистрирован

# AddUser_user
source: User
ru_ru: Пользователь

# AddUser_UserExists
source: User with the same name already exists
ru_ru: Пользователь с таким логином уже зарегистрирован

# MainMenu_AddUser
source: Add user
ru_ru: Добавить пользователя

# RACES_FORWARD
source: Direction(0-from 1st stat., 1-from last)
ru_ru: Направление(0 - от 1-ой ст., 1 - от посл.ст.)

# MainMenu_ChangeUser
source: Change user
ru_ru: Сменить пользователя

# MainMenu_Queries
source: Execute queries
ru_ru: Выполнить запросы

# EditDBWindow_DeleteHint
source: To delete records select them and press delet on keyboard
ru_ru: Чтобы удалить записи, выделите их и нажмите delete на клавиатуре

# Queries_CarriageOfTrains
source: Carriages of trains
ru_ru: Вагони поездов

# Queries_TrainsDestinations
source: Trains` destinations
ru_ru: Тупики поездов

# TRAINS_FINISH
source: End station #2
ru_ru: Конечная станция №2

# TRAINS_START
source: End station #1
ru_ru: Конечная станция №1

# Queries_AdjacentStations
source: Adjacent stations
ru_ru: Смежные станции

# Queries_BoardingCityName
source: Boarding stat. name
ru_ru: Город посадки

# Queries_CityNotExist
source: City {0} doesn`t exist
ru_ru: Станция {0} не существует

# Queries_FinishCity
source: Finish station
ru_ru: Конечная станция

# Queries_InputANumber
source: Input a number
ru_ru: Введите число

# Queries_Name
source: Queries
ru_ru: Запросы к базе

# Queries_NoResult
source: Query`s result is empty
ru_ru: Запрос не дал результатов

# Queries_RacesForTrain
source: Races for train
ru_ru: Рейсы для поезда

# Queries_RacesThrough
source: Find races through
ru_ru: Найти рейсы

# Queries_StartCity
source: Starting station
ru_ru: Начальная станция

# Queries_StationName
source: Station name
ru_ru: Имя станции

# Queries_TicketPrice
source: Ticket price
ru_ru: Цена билета

# Queries_TicketsForRace
source: Tickets for race
ru_ru: Билеты на рейс

# Queries_TrainsThroughStation
source: Trains through station
ru_ru: Поезда через станцию

# MainMenu_Reports
source: Reports
ru_ru: Отчеты

# Report
source: Reports
ru_ru: Отчеты

# AddTrain_CarriagesOfType
source: Carriages of type {0}
ru_ru: Вагонов типа {0}

# AddTrain_FindPath
source: Find path
ru_ru: Найти путь

# AddTrain_From
source: From:
ru_ru: Откуда:

# AddTrain_Name
source: Adding the train
ru_ru: Добавление поезда

# AddTrain_ProblemsAddingTrain
source: An error occured while adding train
ru_ru: Во время добавления поезда произошла ошибка

# AddTrain_RegisterTrain
source: Register train
ru_ru: Добавить поезд

# AddTrain_StationsOnTheWay
source: Stations on the way
ru_ru: Станции на пути

# AddTrain_StopTime
source: Stop time
ru_ru: Время остановки

# AddTrain_SuccessfullyAdded
source: The train has been added successfully
ru_ru: Поезд успешно добавлен

# AddTrain_To
source: To:
ru_ru: Куда:

# AddTrain_TrainType
source: Type of train
ru_ru: Тип поезда

# AddTrain_TrainType_fast
source: Fast
ru_ru: Скорый

# AddTrain_TrainType_high
source: High speed
ru_ru: Скоростной

# AddTrain_TrainType_inter
source: Intercity
ru_ru: Интерсити

# AddTrain_TrainType_usual
source: Usual
ru_ru: Обычный

# MainMenu_BuyTicket
source: Buy a ticket
ru_ru: Купить билет

# AddTrain_CarriagesNeeded
source: The train must have at least one carriage
ru_ru: Поезд должен иметь хотя бы 1 вагон
